# LayoutRule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..LayoutRule Property
RebarContainerItem Class See Also
---
Identifies the layout rule of rebar set.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarLayoutRule LayoutRule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LayoutRule As RebarLayoutRule
	Get
```

Visual C++
---
```text
public:
property RebarLayoutRule LayoutRule {
	RebarLayoutRule get ();
}
```

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace